// BOJ_2693_N번째 큰 수.swift
//배열 A가 주어졌을 때, 3번째 큰 값을 출력하는 프로그램을 작성하시오. 배열 A의 크기는 항상 10이다.
//각 테스트 케이스에 대해 한 줄에 하나씩 배열 A에서 3번째 큰 값을 출력한다.

let input = Int(readLine()!)!

for _ in 0..<input {
    // sort 는 기본적으로 '오름차순 정렬' 이지만, sort(by: >) 를 사용하면 내림차순으로 정렬된다.
    let A = readLine()!.split(separator: " ").map { Int($0)! }.sorted(by: >)
    
    print(A[2])
}

//4
//1 2 3 4 5 6 7 8 9 1000
//338 304 619 95 343 496 489 116 98 127
//931 240 986 894 826 640 965 833 136 138
//940 955 364 188 133 254 501 122 768 408

//8
//489
//931
//768